/* eslint-disable @next/next/no-img-element */
/* eslint-disable @next/next/no-css-tags */
import StoryMapComponent from "components/StoryMapComponent";

const Content = () => (
  <>
    <section className="js-section" data-zoom-middle="2">
      <h2>
        <span className="title-up">雷克雅未克</span>
        <span className="title-down">旅程的起点</span>
      </h2>
      <p className="text-intro">
        我们在大多数窗户里瞥见了好奇张望的脸，看着我们通过这个城镇。
      </p>
      <p>
        让我们大吃一惊的是，在离雷克雅未克约两英里时，我们遇到了乘坐“赛勒斯号”轮船的那位同伴。我们在前往索拉港的途中曾与他共进午餐。我们把他留在了那个港口，他原本打算在法罗群岛逗留数周后再返回英国；但由于发现那里的事情进展缓慢，他乘下一班轮船追随我们来到冰岛，因此我们在路上相遇了。
      </p>
      <p>
        当我们进入冰岛首都时，引起了一些轰动。十点钟时，我们沿着长长的主街疾驰而过；那时人们都在闲暇时间且在街上，他们对我们骑车经过表现出相当的好奇心。他们聚集在小团体中，很明显，我们在被讨论——这并不奇怪，因为我们的队伍看起来五花八门！我们全身上下都沾满泥巴，穿着油布衣，看起来非常滑稽可笑：一路上不时下雨，我们的旅途也相当不愉快。
      </p>
      <figure>
        <img className="js-image" data-pos="0.25" src="https://placehold.co/600x400" />
        <figcaption>
          所有事情都有尽头，我们的旅程在雷克雅未克主街的尽头结束了。
        </figcaption>
      </figure>
      <p>
        我们在大多数窗户里瞥见了好奇张望的脸，看着我们的队伍通过城镇。许多路边的团体向我们致意——冰岛人通常是一个有礼貌的民族，他们会脱帽向陌生人致意。我们就这样前进着，受到致意并回礼。这是一种凯旋式的入场，因为一个导游早已将我们的消息传到前方，他在一些距离前面的几个背驮马匹的人中，告诉我们刚刚穿越了无人居住的内陆地区。所有事情都有尽头，当我们在雷克雅未克主街的尽头停下时，我们的旅程结束了，因为在一座四层楼高的大木屋中，我们安顿下来，横跨冰岛的旅程已经完成。
      </p>
    </section>
    <section className="js-section" data-zoom-start="2">
      <h2>
        <span className="title-up">雷克雅尼斯塔</span>
        <span className="title-down">伸出援手</span>
      </h2>
      <p>
        我们一行共有六人——一个半科学性的团队。有一位J.A.哈斯蒂小姐，她曾在欧洲、亚洲、非洲和美洲旅行过很多地方，并且对南极洲殖民地以及南太平洋岛屿也不陌生。她特别感兴趣的是该国的植物学、民间传说以及人民。然后是W.H.科佩船长；他大部分生活都在海上度过，并在他的旅途中看到了世界上的许多地方；他是我们的航海顾问，在涉及海洋的问题上我们会请教他。W.格伦是哈斯蒂小姐的表弟，被称为团队中的“能手”。如果有人陷入困境，格伦总会在现场伸出援手。他会在适当的时候提供各种各样的东西。如果需要螺丝刀，格伦就有；想要开瓶器，格伦可以提供；剪刀、绳子或皮带，都一样。如果相机罢工了，格伦可以让它恢复正常工作，因为他携带了两个相机，并且可以在不影响自己的摄影工作的情况下借出一个。剑桥国王学院的A.W.希尔是我们团队的植物学家——他描述了他所看到的一切。鲍利学院的H.H.托马斯特别关注我们穿过的国家的地质构造，并且经常可以看到他手持相机拍摄有趣的地质构造——比如冰川化的熔岩表面、火山口或巨大的“漂砾”或“块状岩石”；他还勤奋地绘制草图，并有时用手持罗盘测量地面以记录在他的笔记本中某条裂缝的方向或沿该方向的温泉位置等；或者记录其他对地质学家特别有趣的东西。我是地理学家，我的任务是绘制一小部分穿越地区的地图，获取对该地区地貌的一般概念，并记录山谷、山脉、冰川、雪坡、熔岩流和温泉，以及大河和小溪流。
      </p>
      <figure>
        <img className="js-image" data-pos="0.6" src="https://placehold.co/600x400" />
        <figcaption>
          我是地理学家，我的任务是绘制一小部分穿越地区的地图。
        </figcaption>
      </figure>
      <p>
        第二天，雨、雾和薄雾笼罩着，所以有很多人在下面吹口哨和吸烟，上面则吹着哨子。傍晚时分，我们已经靠近冰岛海岸；由于雾气弥漫，看不见陆地，但毫无疑问，我们可以听到陆地就在不远处。这似乎很奇怪，但事实确实如此，我们实际上是通过蒸汽汽笛的声音来摸索海岸线的。那一带的陆地从海上升起陡峭的悬崖，岩石的陡峭面使船上的军官能够判断他们的距离。我们曾经非常危险地接近另一艘船，但在之后雾稍微散去了一点，就在右舷船舷旁边，刚好可以看到另一艘船，足够近以至于在浓雾中可能成为危险的邻居。午夜时分，我们全速前进，但当我早上七点醒来时，发现我们的雾天经历还没有结束，我们再次处于非常浓密的雾中，而且我们正在抛锚停泊。早餐后，雾气有所缓解，足以让我们设定航向北峡湾，这是我们访问冰岛的第一个港口。北峡湾的许多风景被浓厚的大气遮挡住了，但偶尔透过裂隙看到的景象证明，当我们条件有利时，我们错过了许多美丽的景色。在达拉坦吉角首次看到冰岛是在北峡湾入口以北约四到五英里处。由于迷雾，我们走得太靠北了。在路上还有其他几次瞥见，比如达拉坦吉附近的冰斗和Mjofifjord附近的山脸。我们在北峡湾的停留时间很短，没有时间下船，所以我们唯一看到小镇的机会是从船上的甲板上获得的。
      </p>
    </section>
    <section className="js-section" data-zoom-start="2.5" data-stay="true">
      <h2>
        <span className="title-up">克里苏维克尔布亚尔格</span>
        <span className="title-down">新冒险</span>
      </h2>
      <p>
        在岸上，首先映入眼帘的是法罗群岛人自己：他们是一个优秀的种族，保留了他们本民族的礼貌和独立性格；他们对陌生人的态度极为礼貌。大多数男人是渔民或水手，由于与讲英语的人接触，许多人能用良好的可理解的英语交谈。这里进行少量羊毛贸易，我们遇到了两位岛上居民，他们是这个种族的优秀代表，刚从一天的工作回来；他们是非常有特色的形象，因为他们不仅穿着民族服装，还在身上缠绕了大量的羊毛，这些羊毛在这些岛屿上通常是拔下来的，而不是剪下来的。民族服装包括一种类似酿酒师帽子的东西，通常有红色和蓝色条纹，一件布外套，一件马甲，膝盖分开的紧身裤，但很少有纽扣，粗毛袜和皮鞋。渔民们常常省略外套和马甲，而是穿上一件带有长袖的羊毛套头衫，这种套头衫有一种强烈的羊膻味，上面用浅蓝和红色图案装饰在白色底布上。我看到的女性穿着白色条纹棉布裙子，没有普通的头饰，而是肩上披着一块披巾，常常会把披巾拉到头上，脚上穿着木屐。
      </p>
      <figure>
        <div className="js-gallery-content">
          <img src="https://placehold.co/600x400" />
          <img src="https://placehold.co/600x400" />
          <img src="https://placehold.co/600x400" />
          <img src="https://placehold.co/600x400" />
        </div>
        <figcaption>
          我们的旅程发生了一个意想不到的转折，带领我们去了许多令人印象深刻的地点。
        </figcaption>
      </figure>
      <p>
        我们原计划第二天上午11点出发，但命运对我们不利。在预定的时间，团队的成员都已经准备就绪并等待着，但向导、马匹、鞍具、包鞍和骑行鞍具、帐篷、食品等还没有准备好，除非这些都准备好，否则我们无法出发。鞍具和装备需要大量修理——大部分都是租来的，状态不是很好。我们的事务经理四处奔波，忙着结账，给工人下达指示，检查鞍具、缰绳、肚带和其他装备，试图将混乱转化为秩序。一个小时左右，我们感到很有趣，但随后开始变得不耐烦。三个人拿了一副鞍具和一副缰绳，试着骑了几匹马。这样我们度过了几个小时，可能本来会显得无聊，因为一切都在混乱和不准备的状态中，而且工人们工作的空间又很狭小，我们无法有效帮忙。原定于11点出发，结果到了下午3点半才离开——晚了四个半小时！
      </p>
      <p>
        我雇佣了两个年轻的法罗群岛人划船送我到船上，到达后我叮嘱他们等我以便把我送上岸；然而，当我换完胶片准备返回时，他们却不知去向——这两个小坏蛋带着另一个乘客走了，留下我自己想办法找“搭便车”的机会。我非常想用英语对女王发起攻击，更别说那些法罗群岛的年轻人了，我在甲板上愤怒地踱步时克制住了自己，因为没有一个人可以让我正当抱怨。所以我抑制住怒火，去找一个能说母语的人。最后，我找到一个懂一点英语的法罗群岛人，安排好在一条即将返回岸边的货船上的行程。不久后，我就被运送到Ceres号货船上，虽然对于一艘装载沉重货物的货船来说速度不算快，大约只有每小时一节，但最终我还是按时到达了岸边，刚好赶上在酒店和团队一起吃午饭，我们的东道主正在那里招待我们。我们吃得很开心，在用餐过程中，我们的主人加入了我们对餐桌摆设的批评，尽管有些东西是临时凑合的，但它们并不算太差，餐食本身也相当不错。
      </p>
    </section>
    <section className="js-section" data-zoom-start="1.5">
      <p>
        我拿着相机四处漫步，发现许多妇女和女孩都很愿意被拍照；在一个地方，我发现一群妇女蹲在地上；当我走近时，其他几个人匆忙加入这个群体，同时邀请我给他们拍照，于是我拍下了她们的照片。不久之后，我的胶卷用完了，于是我去Ceres号上补充，它正停泊在离岸半英里远的地方。
      </p>
      <p>
        堡状玄武岩山丘的形成非常引人注目，许多金字塔形的形状给我们留下了深刻的印象。山壁上有许多岩脉，深沟垂直切割在玄武岩结构中，较软的侵入物质比两侧的岩石侵蚀得更快。在Kalso峡湾入口处（西边的Kalso岛和东边的Bordo和Kuno岛之间的通道）有一股很强的水流从南方向我们涌来，因此航线被引导靠近岸边以避开主流。Klaksvig位于Bordo岛的一个海湾中，要到达那里必须向东转，在Kuno和Bordo岛之间转弯。在海湾入口处抛锚，我们在那里过了一整夜。我们靠近Kuno岛的南端，那里有一座非常壮观的金字塔形山峰俯瞰着我们，高度接近2300英尺——这座金字塔可能会让如果路过的Cheops的影子也羞愧得低头并消失。在前往Klaksvig的路上，我们目睹了一些非常漂亮的云彩效果，因为飘过高山的云朵经常在山的下风处拖曳很长一段距离。
      </p>
      <p>
        <blockquote>
          <em>
            宽广、健康、慈善的观点不能通过一生只生活在地球的一个小角落中获得。
          </em>
          <span>&mdash; 马克·吐温</span>
        </blockquote>
      </p>
      <p>
        河岸一侧有一个鳕鱼肝油厂，我们参观了一下；它不像生产鲨鱼油或鲸鱼油的一些工厂那样闻起来那么刺鼻——不过稍后再谈！其中一个大桶里装满了丰富的棕色液体，我们被告知这是未经提炼的鳕鱼肝油。这种油在装入桶后出口，许多桶散落在山坡上。在码头附近可以看到一幅美丽的画面，有几个年轻女子正在一个露天棚下的浴池里忙碌地清洗鳕鱼。
      </p>
      <figure>
        <img className="js-image" data-pos="0.6" src="https://placehold.co/600x400" />
        <figcaption>
          我是地理学家，我的任务是绘制一小部分穿越地区的地图。
        </figcaption>
      </figure>
      <p>
        在航行期间，我经常在半夜写笔记，这天晚上，当我正在船舱里写笔记时，我的“稳定伙伴”突然认为我妨碍了它享受应有的睡眠，于是低声抱怨起来；为了避免惹恼它，我中断了笔记的写作，上床睡觉了；但并没有睡着，因为我刚躺下枕头，就从下面的铺位传来的声音表明，它无意间要反过来对付我，它会通过大声打鼾来阻止我平静地入睡。经过几次无效的努力来制止打鼾，我最后逃到沙龙，远远离开了噪音范围，在那里安安稳稳地休息到早晨。
      </p>
    </section>
    <section className="js-section" data-zoom-start="1.5">
      <h2>
        <span className="title-up">赫韦拉迪</span>
        <span className="title-down">陡峭的岩石面孔</span>
      </h2>
      <p>
        在峡湾西侧，靠近峡湾北端，有一些非常出色的普通玄武岩地貌样本——两个壮丽的冰斗，一条优美的岩脉，一些陡峭的岩石面孔，当我们经过这片土地的尽头时，一个几乎笔直的西向悬崖出现在眼前，而在其脚下矗立着一根孤独的玄武岩柱。当我们沿着峡湾上行时，为了听到以其闻名的美妙回声，经常鸣响蒸汽汽笛；间隔大约三四秒。在冰斗处，声音回荡并再三回荡，直到最终在高处消失。
      </p>
      <p>
        冰岛人非常热情好客，旅行者受到欢迎。每个有能力的农夫家里都有一两个客房供途经的人使用。到达农场时，旅行者会被邀请喝咖啡。当咖啡在房子最好的房间里供应时，农民和他的妻子会与新来的客人一起享用一顿简单的餐点，包括优质的咖啡和同样优质的精致点心。一些冰岛妇女是很好的糕点师傅，她们制作的蛋糕和点心往往可以媲美伦敦一流糖果店的产品。
      </p>
      <p>
        在德拉格哈拉萨河上有一些漂亮的场景，这是一条有趣的河流，有许多硬岩和软岩被水切开，水从一系列瀑布倾泻而下，流入附近的湖泊，溢出的水流入附近的池塘。池塘和河流为垂钓者提供了乐趣，哈斯蒂小姐和乔恩在那里捕获了一篮子鳟鱼。我运气不好；但我开始钓鱼时，其他人已经结束了，我认为他们把河里的鱼都抓光了，没剩下给我抓的鱼——但我不擅长钓鱼，技能不足可能是导致我收获不多的原因。
      </p>
      <figure>
        <img className="js-image" data-pos="0.6" src="https://placehold.co/600x400" />
        <figcaption>
          蒸汽汽笛的声音再次响起，我们的耳朵再次被尖锐的汽笛声折磨。
        </figcaption>
      </figure>
      <p>
        一走出峡湾并驶向外海，我们就遇到了来自西方的轻微涌浪，船只开始摇晃；其实并不严重，但对于那些不习惯晕船的人来说，这是第一次航行体验，很多人对此很不喜欢。
        清澈的空气很快就被遗忘了，因为我们进入了离陆地仅几英里远的另一个雾区。立即，蒸汽汽笛的声音再次响起，我们的耳朵再次被尖锐的汽笛声折磨。
      </p>
      <p>
        在桥下方可以看到一个非常奇妙的景象。沿着右岸的河水长达半英里，一系列瀑布流入其中。水从构成陡岸的熔岩下面流出，然后顺着坡流下；这是一个非常明显的地下河流的例子。在桥上方有一个非常壮观的瀑布，称为Barnafoss，虽然壮观，但不能与Gullfoss相比，这部分河流的荣耀在于它右侧岸边的一系列瀑布。这个地方据说是因为附近瀑布淹死了两个孩子而得名的Barnafoss，即孩子们的瀑布；但雷克霍特的牧师宣称这个故事不属实，这个名字更有可能是Bjarni这个名字的变体，Bjarni是男性名字。值得注意的是，白桦树林似乎在腐朽的熔岩和火山熔岩场的土壤中生长得最好；它也在由脂长岩产生的土壤中生长良好，因为它在东侧的脂长岩山上长得很高。
      </p>
    </section>
    <section
      className="js-section"
      data-zoom-start="1.5"
      data-zoom-middle="1"
      data-icon="/image/story/plane.svg"
    >
      <h2>
        <span className="title-up">黄金瀑布</span>
        <span className="title-down">在云端之上</span>
      </h2>
      <p>
        黄金瀑布是冰岛最著名的景点之一。它是一个壮丽的瀑布，在Hvitá河上，河水白色的水从一系列台阶状的屏障上倾泻而下，然后最终冲过非常坚硬的岩石，坠入一个超过一百英尺深的深渊，从而喷起厚厚的水雾，随着风向这边那边吹拂，水雾被带到各个地方；水雾如此之厚，以至于不小心进入时衣服很快就湿透了。
      </p>
      <p>
        黄金瀑布是欧洲最壮观的瀑布之一，如果有的话，只有少数几个在冰岛的瀑布可以超越它。当我们到达时，阳光明媚，彩虹在喷涌的水雾上闪耀，就像在峡谷上方一样。后来天空变阴了，我们离开黄金瀑布之前就开始下雨了，但我们带走的印象是瀑布断裂的水在阳光下闪闪发光，以及彩虹在峡谷上方喷涌的水雾中嬉戏。河水在玄武岩中雕刻出一个深深的峡谷，峡谷下方有许多优良的玄武岩柱样本。在峡谷的下部，可以看到非常漂亮的硬岩脉的遗迹，旁边有一个柔软得多的岩脉。这些遗迹在河的两岸都能看到，并且它们呈现出一系列城堡建筑的轮廓和形状，高高地坐落在突出的山峰上。
      </p>
      <figure>
        <img src="https://placehold.co/600x400" />
        <figcaption>
          更远的地方有许多冰川作用的证据：圆形的卵石吸引了我们的注意，还有许多在它们上面的冰痕；一些突出的石块非常圆润。
        </figcaption>
      </figure>
    </section>
    <section className="js-section" data-zoom-start="1.2">
      <h2>
        <span className="title-up">艾雅法拉冰盖</span>
        <span className="title-down">最终目的地</span>
      </h2>
      <p>
        哈斯蒂小姐可能在选择用于清洁的温泉处有过一次尴尬的经历，当时她不知道这个温泉的活动是周期性的。在早餐时，一个导游告诉我们，她用来当作热水龙头的小间歇泉“出了问题”。后来的经验证明，这样的池子不适合任何形式的清洁。一些手帕单独浸泡在那里，两个小时后发现它们正通过盆地的排水孔自行移动，还有一个完全被吸进去的手帕在随后的间歇泉喷发中没有被返还。
      </p>
      <p>
        我们在蓝暖流旁边搭建帐篷，面向硅华梯田，因为第二天是星期日，我们在那里扎营了两天。我们都拍了很多关于梯田和温泉的照片，并尝试捕捉小型间歇泉喷发时的情况，除了少数例外，它们每隔很短的时间就会喷发；虽然喷发不太剧烈，水也不会被抛到很高的高度，可能最大高度只有三英尺。
      </p>
      <figure>
        <img src="https://placehold.co/600x400" />
        <figcaption>
          我来到这个国家的这一部分，打算快速浏览一下，因为我们从一端到另一端穿越了整个区域。
        </figcaption>
      </figure>
      <p>
        第二天用于探索周围地区，团队的不同成员对不同的特征印象深刻。托马斯和我一起出发了。我们走向高地，环顾四周；我们立刻看到我们站在最近一次（地质学意义上）火山喷发的边缘。大约四英里外，有两个突起，我们后来发现它们是火山斯特里图尔锥体的唯一显著遗迹，火山喷发的熔岩就是从这里喷出的。斯特里图尔位于两大冰川中间的长条形地带中央，大致与两大冰川（朗格约库尔和霍夫约库尔）等距，每个冰川的面积约为五百平方英里。
      </p>
    </section>
    <section className="js-section" data-stay="true" data-zoom-start="1.2">
      <p>
        这个长条形地带在最窄处约为十四英里宽（并非现有地图上显示的八英里），南北延伸约二十五英里。斯特里图尔位于南北流向的水系之间的分水岭上，也是这片土地的最高部分。熔岩从火山喷发出来后，沿着火山两侧的缓坡向北和向南流动，并向东和向西扩展到冰川边缘的外围山脉。它向北延伸到杜福费尔以北，向南几乎到达湖胡伊塔瓦特纳。
      </p>
      <p>
        <blockquote>
          <em>只带走回忆，留下足迹。</em>
          <span>&mdash; 西雅图酋长</span>
        </blockquote>
      </p>
    </section>
    <section className="js-section" data-stay="true" data-zoom-start="0.8">
      <p>你好</p>
    </section>
  </>
);

export default function Home() {
  return (
    <>
      {/* <div className="intro">
        <blockquote>
          <em>
            “Twenty years from now you will be more disappointed by the things
            you didn’t do <br />
            than by the ones you did do.”
          </em>
          <span>Mark Twain</span>
        </blockquote>
      </div> */}
      <StoryMapComponent mapSrc="/image/story/example.svg">
        <Content />
      </StoryMapComponent>
    </>
  );
}
